#include<stdio.h>
int main() {
    int x,y,color,dx,dy;
    int chess[8][8]={
    {0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0},
    {0,0,0,1,2,0,0,0},
    {0,0,0,2,1,0,0,0},
    {0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0}};
//--------------------------------------------------   
    scanf("%d %d %d",&x,&y,&color);
    if(chess[x][y]==0)
        printf("這個位子沒有棋子");
    if(chess[x][y]==1)
        printf("這個位子是黑棋");
    if(chess[x][y]==2)
        printf("這個位子是白棋");

//--------------------------------------------------        
    chess[x][y]=color;
    for(int i=2;i<8;i++){
        for(dx=-1;dx<=1;dx++){
            for(dy=-1;dy<=1;dy++){
                int _x=x+i*dx;
                int _y=y=i*dy;
                if(_x>=0 && _x<=7 && _y>0 && _y<=7){
                    if(chess[_x][_y]==chess[x][y] || chess[_x][_y]==0)
                        break;
                }
            }
        }
    }

}
